configuration/src/InformationRegisters/ПричиныИзмененияСтатусаОбъектов/ПричиныИзмененияСтатусаОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПричиныИзмененияСтатусаОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>CatalogRef.ПричиныИзмененияСтатусов</types>
    </type>
  </attributes>
  <attributes>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПричины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПричиныИзмененияСтатусаОбъектов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр
//
// Параметры:
//  Объект					 - СоставнойТип	 - ссылка на задачу, заявку, внутреннее задание или проект
//  Статус					 - СправочникСсылка.СтатусыОбъектов	 - ссылка на статус
//  ПричинаИзмененияСтатуса	 - СправочникСсылка.ПричиныИзмененияСтатусов, Массив	 - ссылка на причину изменения статуса
//  Комментарий				 - Строка	 - комментарий
//
Процедура Добавить(Знач Объект, Знач Статус, Знач ПричинаИзмененияСтатуса, Знач Комментарий, Знач Система = Неопределено) Экспорт
	
	Период = ТекущаяДатаСеанса(); 
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(Период);
	Набор.Отбор.Объект.Установить(Объект);
	
	Если ТипЗнч(ПричинаИзмененияСтатуса) = Тип("Массив") Тогда
		Данные = ПричинаИзмененияСтатуса;
	Иначе
		Данные = Новый Массив;
		Данные.Добавить(ПричинаИзмененияСтатуса);
	КонецЕсли;
	
	Счетчик = 1;
	
	Для Каждого Причина Из Данные Цикл	 
		НоваяЗапись = Набор.Добавить();
		НоваяЗапись.НомерПричины = Счетчик;
		НоваяЗапись.Объект = Объект;
		НоваяЗапись.Период = Период;
		НоваяЗапись.Статус = Статус;
		НоваяЗапись.Система = Система;
		НоваяЗапись.ПричинаИзмененияСтатуса = Причина;
		НоваяЗапись.Комментарий = Строка(Комментарий);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
